<?xml version="1.0" encoding="utf-8"?>
<search>
  <entry>
    <title>3D-Render</title>
    <url>/posts/2020-09-002.html</url>
    <content><![CDATA[<p>选择Sokolov的<a href="https://github.com/ssloy/tinyrenderer">Tiny Renderer</a>教程开始入门。<br />
Sokolov从一个最简单的画点函数开始，一个小节一个小节地讲解怎么画出一条线，怎么填充一个面，怎么逐步加入背面剔除、深度测试、透视相机、着色器等高级功能。每个小节的课程都有详细的讲解以及完整的实现代码可供参考。这个教程一共有9个小节，只要学到第6个小节我们就已经可以实现一个具有可编程渲染管线的软件渲染器了，而这时候的总代码量只有500行而已，可以说是非常简洁适合入门了。</p>
<p>本文只记录在学习过程中遇到的一些问题，和自己的一些想法</p>
<h3 id="lesson-1-bresenhams-line-drawing-algorithm"><a class="markdownIt-Anchor" href="#lesson-1-bresenhams-line-drawing-algorithm"></a> Lesson 1 Bresenham’s Line Drawing Algorithm</h3>
<h4 id="second-attempt中"><a class="markdownIt-Anchor" href="#second-attempt中"></a> Second attempt中</h4>
<pre><code>void line(int x0, int y0, int x1, int y1, TGAImage &amp;image, TGAColor color) &#123; 
    for (int x=x0; x&lt;=x1; x++) &#123; 
        float t = (x-x0)/(float)(x1-x0); 
        int y = y0*(1.-t) + y1*t; 
        image.set(x, y, color); 
    &#125; 
&#125;
</code></pre>
<p>它默认从x0到x1递增画线，而没有考虑到x0和x1的大小。如果x0&gt;x1，此函数就没有作用。</p>
<h4 id="从fourth-attempt-continued-到-fifth-and-final-attempt的优化中"><a class="markdownIt-Anchor" href="#从fourth-attempt-continued-到-fifth-and-final-attempt的优化中"></a> 从Fourth attempt continued 到 fifth and final attempt的优化中</h4>
<p>Fourth attempt continued</p>
<pre><code>void line(int x0, int y0, int x1, int y1, TGAImage &amp;image, TGAColor color) &#123; 
    bool steep = false; 

<h3 id="下载onemanager"><a class="markdownIt-Anchor" href="#下载onemanager"></a> 下载OneManager</h3>
<ol>
<li>前往 <a href="https://github.com/qkqpttgf/OneManager-php">OneManager项目地址</a>下载并完成解压，为之后准备。</li>
</ol>
<h3 id="部署"><a class="markdownIt-Anchor" href="#部署"></a> 部署</h3>
<p>选择腾讯云函数，有免费额度，一般来说够用了。</p>
<ol>
<li>
<p>新建函数，输入名称，运行环境选择php7.2，创建方式选择空白函数<br />
<img src= "https://cdn.jsdelivr.net/gh/slyli/slyli.github.io/image/static/loading.gif" data-lazy-src="https://cdn.jsdelivr.net/gh/slyli/slyli.github.io/image/2020-08/cloud1.png" alt="" /></p>
</li>
<li>
<p>通过本地上传文件夹方式，上传之前解压后的OneManager文件夹<br />
<img src= "https://cdn.jsdelivr.net/gh/slyli/slyli.github.io/image/static/loading.gif" data-lazy-src="https://cdn.jsdelivr.net/gh/slyli/slyli.github.io/image/2020-08/cloud2.png" alt="" /><br />
<img src= "https://cdn.jsdelivr.net/gh/slyli/slyli.github.io/image/static/loading.gif" data-lazy-src="https://cdn.jsdelivr.net/gh/slyli/slyli.github.io/image/2020-08/cloud3.png" alt="" /></p>
</li>
<li>
<p>创建触发器，选择API网关触发器<br />
<img src= "https://cdn.jsdelivr.net/gh/slyli/slyli.github.io/image/static/loading.gif" data-lazy-src="https://cdn.jsdelivr.net/gh/slyli/slyli.github.io/image/2020-08/cloud4.png" alt="" /></p>
</li>
<li>
<p>（可选）点击触发器的API服务名 <code>SCF_API_SERVICE</code>，可以自定义域名。<br />
<img src= "https://cdn.jsdelivr.net/gh/slyli/slyli.github.io/image/static/loading.gif" data-lazy-src="https://cdn.jsdelivr.net/gh/slyli/slyli.github.io/image/2020-08/cloud5.png" alt="" /></p>
</li>
</ol>
<h3 id="安装"><a class="markdownIt-Anchor" href="#安装"></a> 安装</h3>
<ol start="5">
<li>点击触发器下方访问路径，后安装项目，选择新建 SecretId &amp; SecretKey，返回腾讯云新建密钥，完成后将 SecretId &amp; SecretKey填入其中。</li>
</ol>
<p><img src= "https://cdn.jsdelivr.net/gh/slyli/slyli.github.io/image/static/loading.gif" data-lazy-src="https://cdn.jsdelivr.net/gh/slyli/slyli.github.io/image/2020-08/cloud6.png" alt="" /></p>
<ol start="6">
<li>设置完密码后登录，通过管理-设置，点击 <code>添加Onedrive盘</code>，然后再填写相关内容就ok了。<br />
<img src= "https://cdn.jsdelivr.net/gh/slyli/slyli.github.io/image/static/loading.gif" data-lazy-src="https://cdn.jsdelivr.net/gh/slyli/slyli.github.io/image/2020-08/cloud7.png" alt="" /></li>
</ol>
<div class="note warning flat"><ul>
<li>个人账号选择  MS: 国际版（商业版与个人版）</li>
<li>学生账号只能选择 ShareUrl: 共享链接， 对一个Onedrive文件夹共享进行使用</li>
</ul>
</div>
<p>本人网盘链接 <a href="http://cloud.slyli.cn/cloud">http://cloud.slyli.cn/cloud</a></p>
<p>目前上传了一部剧：《如此可爱的我们》。然后把之前博客中需要的视频也搬到这上面了。</p>
]]></content>
      <categories>
        <category>others</category>
      </categories>
  </entry>
  <entry>
    <title>C++</title>
    <url>/posts/2020-07-009.html</url>
    <content><![CDATA[<h3 id="virtural继承"><a class="markdownIt-Anchor" href="#virtural继承"></a> virtural继承</h3>
<pre><code>class AAAA &#123; int  a; &#125;;
class BBBB :public virtual AAAA &#123; int b; char a; &#125;;
class CCCC :public virtual AAAA &#123; int c; &#125;;
class DDDD :public BBBB, public CCCC &#123; int d; &#125;;
</code></pre>
<p>内存分布：</p>
<h4 id="aaaa"><a class="markdownIt-Anchor" href="#aaaa"></a> AAAA</h4>
<pre><code>1&gt;class AAAA	size(4):
1&gt;	+---
1&gt; 0	| a
1&gt;	+---
</code></pre>
<h4 id="bbbb"><a class="markdownIt-Anchor" href="#bbbb"></a> BBBB</h4>
<pre><code>1&gt;class BBBB	size(20):
1&gt;	+---
1&gt; 0	| &#123;vbptr&#125;   虚基类指针，占8位
1&gt; 8	| b
1&gt;  	| &lt;alignment member&gt; (size=4)
1&gt;	+---
1&gt;	+--- (virtual base AAAA)    虚基类中的a，占4位
1&gt;16	| a
1&gt;	+---
1&gt;BBBB::$vbtable@:  虚基类表，偏移16的位置为虚基类AAAA
1&gt; 0	| 0
1&gt; 1	| 16 (BBBBd(BBBB+0)AAAA)
1&gt;vbi:	   class  offset o.vbptr  o.vbte fVtorDisp
1&gt;            AAAA      16       0       4 0
</code></pre>
<h4 id="cccc"><a class="markdownIt-Anchor" href="#cccc"></a> CCCC</h4>
<pre><code>1&gt;class CCCC	size(20):
1&gt;	+---
1&gt; 0	| &#123;vbptr&#125;
1&gt; 8	| c
1&gt;  	| &lt;alignment member&gt; (size=4)
1&gt;	+---
1&gt;	+--- (virtual base AAAA)
1&gt;16	| a
1&gt;	+---
1&gt;CCCC::$vbtable@:
1&gt; 0	| 0
1&gt; 1	| 16 (CCCCd(CCCC+0)AAAA)
1&gt;vbi:	   class  offset o.vbptr  o.vbte fVtorDisp
1&gt;            AAAA      16       0       4 0
</code></pre>
<h4 id="dddd"><a class="markdownIt-Anchor" href="#dddd"></a> DDDD</h4>
<pre><code>1&gt;class DDDD	size(44):
1&gt;	+---
1&gt; 0	| +--- (base class BBBB)
1&gt; 0	| | &#123;vbptr&#125;
1&gt; 8	| | b
1&gt;  	| | &lt;alignment member&gt; (size=4)
1&gt;  	| | &lt;alignment member&gt; (size=4)
1&gt;	| +---
1&gt;16	| +--- (base class CCCC)
1&gt;16	| | &#123;vbptr&#125;
1&gt;24	| | c
1&gt;  	| | &lt;alignment member&gt; (size=4)
1&gt;  	| | &lt;alignment member&gt; (size=4)
1&gt;	| +---
1&gt;32	| d
1&gt;  	| &lt;alignment member&gt; (size=4)
1&gt;	+---
1&gt;	+--- (virtual base AAAA)
1&gt;40	| a
1&gt;	+---
1&gt;DDDD::$vbtable@BBBB@:
1&gt; 0	| 0
1&gt; 1	| 40 (DDDDd(BBBB+0)AAAA)
1&gt;DDDD::$vbtable@CCCC@:
1&gt; 0	| 0
1&gt; 1	| 24 (DDDDd(CCCC+0)AAAA)
1&gt;vbi:	   class  offset o.vbptr  o.vbte fVtorDisp
1&gt;            AAAA      40       0       4 0
</code></pre>
<h3 id="virtual-虚函数"><a class="markdownIt-Anchor" href="#virtual-虚函数"></a> virtual 虚函数</h3>
<p>虚函数是指一个类中你希望重写(override)的成员函数，当你用一个基类指针或引用,指向一个继承类对象的时候，调用一个虚函数时, 实际调用的是继承类的版本。</p>
<pre><code>class Animal &#123;
public :
    void  Print()
    &#123; 
        cout &lt;&lt; &quot;Animal&quot; &lt;&lt; endl; 
    &#125;
&#125;;
class Dog: public Animal
&#123;
public:
    void  Print() 
    &#123;
        cout &lt;&lt; &quot;Dog&quot; &lt;&lt; endl;
    &#125;
private:
&#125;;
int main(int argc, char** argv)
&#123;
    Animal* d = new Dog();
    d-&gt;Print();
&#125;
</code></pre>
<p>没有使用<code>virtual</code>时，函数的输出的是<code>Animal</code></p>
<pre><code>class Animal &#123;
public :
    virtual void  Print()
    &#123; 
        cout &lt;&lt; &quot;Animal&quot; &lt;&lt; endl; 
    &#125;
&#125;;
class Dog: public Animal
&#123;
public:
    void  Print() 
    &#123;
        cout &lt;&lt; &quot;Dog&quot; &lt;&lt; endl;
    &#125;
private:
&#125;;
int main(int argc, char** argv)
&#123;
    Animal* d = new Dog();	
    d-&gt;Print();
&#125;
</code></pre>
<p>内存布局：</p>
<pre><code>1&gt;class Animal	size(8):
1&gt;	+---
1&gt; 0	| &#123;vfptr&#125;   虚表指针
1&gt;	+---
1&gt;Animal::$vftable@:    虚函数表
1&gt;	| &amp;Animal_meta
1&gt;	|  0
1&gt; 0	| &amp;Animal::Print    可能有多个虚函数
1&gt;Animal::Print this adjustor: 0

1&gt;class Dog	size(8):
1&gt;	+---
1&gt; 0	| +--- (base class Animal)
1&gt; 0	| | &#123;vfptr&#125;
1&gt;	| +---
1&gt;	+---
1&gt;Dog::$vftable@:
1&gt;	| &amp;Dog_meta
1&gt;	|  0
1&gt; 0	| &amp;Dog::Print
1&gt;Dog::Print this adjustor: 0
</code></pre>
<p>使用<code>virtual</code>后，函数的输出是<code>Dog</code></p>
<p>没有使用virtual之前，C++对成员函数使用静态绑定，函数的调用地址在运行前就已经固定。不考虑指针指向的内容，对于什么类型的指针就调用什么类型的函数。<br />
对于虚函数，每个派生类对象都有一个指向虚函数表的指针，访问任何虚函数都是间接通过这个指针进行的，之所以要用虚函数表，是因为调用一个虚函数的哪个版本是在运行过程（调用时指针所指的对象）才能确定的（动态绑定）。</p>
<p>这也可以叫运行时多态。</p>
<div class="note warning flat"><p>因此特性，若基类的析构函数是non-virtual的，容易造成局部销毁，导致资源泄漏。非常危险。</p>
</div>
<p>编译期多态：对模板参数而言，多态是通过模板具现化和函数重载解析实现的。以不同的模板参数具现化导致调用不同的函数，这就是所谓的编译期多态。</p>
<pre><code>class Dog
&#123;
public:
    void shout()&#123; cout &lt;&lt; &quot;Dog&quot;&lt;&lt;endl; &#125;
&#125;;
class Cat
&#123;
public:
    void shout()&#123; cout &lt;&lt; &quot;Cat&quot;&lt;&lt;endl; &#125;
&#125;;

template &lt;typename T&gt;
void  Animal(T &amp; t)
&#123;
    t.shout();
&#125;

int main()
&#123;
    Dog dog;
    Cat cat; 
    animalShout(dog);
    animalShout(cat);   
&#125;
</code></pre>
<p>在编译之前，函数模板中t.shout()调用的是哪个接口并不确定。在编译期间，编译器推断出模板参数，因此确定调用的shout是哪个具体类型的接口。不同的推断结果调用不同的函数，这就是编译器多态。</p>
<h3 id="virtural继承下的虚函数"><a class="markdownIt-Anchor" href="#virtural继承下的虚函数"></a> virtural继承下的虚函数</h3>
<pre><code>class Base &#123;
public:
    int x;
    virtual void func() &#123;  &#125;;
    virtual void func1() &#123;  &#125;;
    virtual void func2() &#123;  &#125;;
&#125;;
class Derive:public virtual Base &#123;
public:
    int y;
    virtual void func1() &#123;  &#125;;
    virtual void func2() &#123;  &#125;;
    virtual void func3() &#123;  &#125;;
&#125;;
</code></pre>
<p>内存布局</p>
<pre><code>1&gt;class Base	size(16):
1&gt;	+---
1&gt; 0	| &#123;vfptr&#125;
1&gt; 8	| x
1&gt;  	| &lt;alignment member&gt; (size=4)
1&gt;	+---
1&gt;Base::$vftable@:
1&gt;	| &amp;Base_meta
1&gt;	|  0
1&gt; 0	| &amp;Base::func
1&gt; 1	| &amp;Base::func1
1&gt; 2	| &amp;Base::func2
1&gt;Base::func this adjustor: 0
1&gt;Base::func1 this adjustor: 0
1&gt;Base::func2 this adjustor: 0
1&gt;class Derive	size(40):
1&gt;	+---
1&gt; 0	| &#123;vfptr&#125;
1&gt; 8	| &#123;vbptr&#125;
1&gt;16	| y
1&gt;  	| &lt;alignment member&gt; (size=4)
1&gt;	+---
1&gt;	+--- (virtual base Base)
1&gt;24	| &#123;vfptr&#125;
1&gt;32	| x
1&gt;  	| &lt;alignment member&gt; (size=4)
1&gt;	+---
1&gt;Derive::$vftable@Derive@:
1&gt;	| &amp;Derive_meta
1&gt;	|  0
1&gt; 0	| &amp;Derive::func3
1&gt;Derive::$vbtable@:
1&gt; 0	| -8
1&gt; 1	| 16 (Derived(Derive+8)Base)
1&gt;Derive::$vftable@Base@:
1&gt;	| -24
1&gt; 0	| &amp;Base::func
1&gt; 1	| &amp;Derive::func1
1&gt; 2	| &amp;Derive::func2
1&gt;Derive::func1 this adjustor: 24
1&gt;Derive::func2 this adjustor: 24
1&gt;Derive::func3 this adjustor: 0
1&gt;vbi:	   class  offset o.vbptr  o.vbte fVtorDisp
1&gt;            Base      24       8       4 0
</code></pre>
<h3 id="const"><a class="markdownIt-Anchor" href="#const"></a> <code>const</code></h3>
<ul>
<li>
<p>const在指针左边时，指针指向的内容是const。</p>
</li>
<li>
<p>const在指针右边时，指针是const指针</p>
</li>
<li>
